Revit 2027 API
PropertyLine.GetBoundary Method
 Gets the boundary of current PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetBoundary()
Public Function GetBoundary As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetBoundary()
member GetBoundary : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The curve loops that represent the boundary of the PropertyLine element.
Exceptions
Exception | Condition
InvalidOperationException |  Failed to get boundary of current PropertyLine element if it is not create by sketch.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace